Application/advanced/frontend/controllers/ReservationController.php

    protected function findModel($id)
    {
        if (($model = Reservation::findOne($id)) !== null) {
---
SELECT * FROM `reservation` WHERE `id`='1'