Application/advanced/backend/controllers/ReservationController.php

SELECT * FROM `reservation` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Reservation::findOne($id)) !== null) {