Application/advanced/frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->first_name = $this->first_name;
        $user->last_name = $this->last_name;
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`first_name`, `last_name`, `username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('Maica', 'Belchez', 'mac', 'mb@email.com', '$2y$13$AoRBRP8oGlCSVcIJN5P8g.21GW7AuidPerHLbmgJMM4wb/15uToDa', 'A-PyxvUC0y9t6bxy66tXTRPXwkYC0d_4', 10, 1481673951, 1481673951)